package utils_test

import (
	"MediaWarp/utils"
	"testing"
)

var subtitle1 = `
1
00:00:05,510 --> 00:00:07,100
好痛…

2
00:00:07,630 --> 00:00:08,800
好痛…

3
00:00:14,440 --> 00:00:17,360
救救我…好冷…

4
00:00:23,800 --> 00:00:26,410
不要…我不要…

5
00:00:32,760 --> 00:00:34,500
可惡 可惡

6
00:00:36,390 --> 00:00:37,420
媽媽？

7
00:00:41,230 --> 00:00:41,990
媽…

8
00:00:51,180 --> 00:00:51,850
又是這個夢

9
00:00:52,490 --> 00:00:53,520
你醒了？

10
00:00:54,960 --> 00:00:56,290
你怎麼在這？

11
00:00:58,440 --> 00:01:00,900
別擺出這副嚇人的表情嘛

12
00:01:03,570 --> 00:01:07,340
我可是給你帶來了一張…一夜暴富的車票哦

13
00:01:09,300 --> 00:01:12,770
別礙事 你這美人計對我沒用

14
00:01:12,900 --> 00:01:14,700
真是的 裝什麼老成

15
00:01:16,170 --> 00:01:18,420
這次肯定不會有錯

16
00:01:18,940 --> 00:01:22,960
值得信賴的人說了在用 我才買下來的

17
00:01:23,110 --> 00:01:25,490
你都被這種說辭騙過多少次了

18
00:01:29,400 --> 00:01:31,610
活得這麼馬虎 小心最後不得善終

19
00:01:31,710 --> 00:01:33,530
別廢話了 你就試試吧

20
00:01:33,960 --> 00:01:35,500
說不定 說不定呢

21
00:01:36,090 --> 00:01:36,630
接著

22
00:01:39,310 --> 00:01:42,250
至今為止這個倒算是最看得過去的了

23
00:01:42,300 --> 00:01:43,590
對吧

24
00:01:46,050 --> 00:01:47,700
姑且先試試吧

25
00:01:52,440 --> 00:01:54,630
反正也沒別的事可做了

26
00:01:59,170 --> 00:02:00,500
在這樣的世界裡

27
00:02:14,310 --> 00:02:14,570
備受期待的全新大規模能源資源

28
00:02:14,570 --> 00:02:17,670
(日誌 01 前往海之搖籃)
備受期待的全新大規模能源資源

29
00:02:17,670 --> 00:02:17,810
(日誌 01 前往海之搖籃)

30
00:02:17,810 --> 00:02:19,280
天照計劃
(日誌 01 前往海之搖籃)

31
00:02:19,280 --> 00:02:19,290
天照計劃

32
00:02:19,780 --> 00:02:24,840
其第一階段內容是籌劃已久的火箭發射項目

33
00:02:24,840 --> 00:02:26,920
市民的反對呼聲仍舊高漲…

34
00:02:27,220 --> 00:02:29,200
這次能發射出去嗎

35
00:02:29,520 --> 00:02:30,200
肯定能

36
00:02:31,150 --> 00:02:34,390
可是 有那個放煙花的閒錢

37
00:02:34,630 --> 00:02:38,110
還不如拿來改善我們老百姓的生活吧

38
00:02:39,140 --> 00:02:41,560
撐得了一時撐不了一世

39
00:02:42,340 --> 00:02:43,740
必須得開創未來

40
00:02:44,320 --> 00:02:46,460
話說回來 這真是塊破銅爛鐵

41
00:02:46,650 --> 00:02:48,570
真能靠它潛下去嗎

42
00:02:48,700 --> 00:02:50,700
不是大嬸你讓我去潛水的嗎

43
00:02:50,790 --> 00:02:51,930
叫我凱瑟琳

44
00:02:52,190 --> 00:02:54,630
再叫大嬸就把你沉到海底去

45
00:02:55,120 --> 00:02:57,510
說到底「凱瑟琳」不也是化名嗎

46
00:02:57,840 --> 00:02:59,090
跟大嬸有啥區別

47
00:02:59,090 --> 00:03:02,820
少廢話 每個人都有難言之隱的

48
00:03:02,830 --> 00:03:05,070
小夏

49
00:03:09,740 --> 00:03:11,960
小夏 一起去上學吧

50
00:03:14,280 --> 00:03:15,290
人家在叫你呢

51
00:03:15,700 --> 00:03:17,620
不用管 她遲早會放棄的

52
00:03:18,080 --> 00:03:21,520
被甩了呢 學會放棄也是戀愛的必修課哦

53
00:03:22,070 --> 00:03:24,060
才 才不是那樣呢

54
00:03:27,410 --> 00:03:30,360
我還以為你終於不再陰魂不散了呢

55
00:03:30,700 --> 00:03:33,120
別把我說得像個瘟神一樣

56
00:03:33,690 --> 00:03:37,140
我可是這位斑鳩夏生的合伙人(partner)呢

57
00:03:38,040 --> 00:03:39,100
伴侶？

58
00:03:39,880 --> 00:03:41,310
別胡說八道了

59
00:03:41,590 --> 00:03:43,950
你不就是個滿口可疑點子的騙子嗎

60
00:03:43,950 --> 00:03:45,280
哪裡可疑了

61
00:03:45,580 --> 00:03:49,840
你祖母家裡沉眠著寶藏這個消息是絕對不會有錯的

62
00:03:50,180 --> 00:03:51,830
小夏的祖母？

63
00:03:52,180 --> 00:03:54,110
是那位什麼學家嗎

64
00:03:54,460 --> 00:03:57,330
海洋地質學博士 八千草乃音子

65
00:03:57,900 --> 00:04:00,300
她要我去找沉眠在祖母家的寶藏

66
00:04:00,540 --> 00:04:03,960
靠這個去撿回來 再跟她對半分

67
00:04:04,530 --> 00:04:06,110
好 好可疑…

68
00:04:06,110 --> 00:04:07,010
你們好煩

69
00:04:07,460 --> 00:04:08,840
所以呢 搞好了嗎

70
00:04:09,330 --> 00:04:12,760
嗯 前提是剛才那個零件沒問題

71
00:04:13,760 --> 00:04:15,100
真的嗎

72
00:04:15,590 --> 00:04:18,260
等 等等 你要坐這個潛到海裡去？

73
00:04:18,780 --> 00:04:19,280
對啊

74
00:04:19,440 --> 00:04:23,350
還是算了吧 要珍惜生命呀
`
var subtitle2 = `
1
00:00:48,422 --> 00:00:53,177
Once upon a time there was a lovely princess.

2
00:00:53,427 --> 00:01:02,019
But she had an enchantment upon her of a fearful sort,
which could only be broken by Love's first kiss.

3
00:01:02,270 --> 00:01:08,609
She was locked away in a castle guarded by a terrible
fire breathing dragon.

4
00:01:08,860 --> 00:01:15,992
Many brave knights had attempted to free her from
this dreadful prison, but none prevailed.

5
00:01:16,242 --> 00:01:23,040
She waited in the dragon's keep in the highest
room of the tallest tower for her true love

6
00:01:23,291 --> 00:01:27,253
and true love's first kiss.

7
00:01:27,503 --> 00:01:29,714
Like that's ever going to happen.

8
00:01:29,964 --> 00:01:34,552
What a loony.

9
00:01:51,485 --> 00:01:57,658
Shrek
`
var subtitle3 = `
33
00:02:24,840 --> 00:02:26,920
市民的反對呼聲仍舊高漲…

34
00:02:27,220 --> 00:02:29,200
這次能發射出去嗎

35
00:02:29,520 --> 00:02:30,200
肯定能

36
00:02:31,150 --> 00:02:34,390
可是 有那個放煙花的閒錢
`
var subtitle4 = `
1
100:00:01,000 --> 00:00:04,000
字幕示例

2
00:00:05,000 --> 00:00:08,000
第二行字幕示例`

type TestCase struct {
	Text   string
	Result bool
}

var testCases = map[string]TestCase{
	"字幕1": {subtitle1, true},
	"字幕2": {subtitle2, true},
	"字幕3": {subtitle3, true},
	"字幕4": {subtitle4, true},
}

func TestIsSrt(t *testing.T) {

	for caseName, testCase := range testCases {
		t.Run(caseName, func(t *testing.T) {
			result := utils.IsSRT(testCase.Text)
			if testCase.Result != result {
				t.Errorf("%s 解析错误。期望: %t, 实际: %t", caseName, testCase.Result, result)
			}
		})
	}
}

func BenchmarkIsSrt(b *testing.B) {
	for i := 0; i < b.N; i++ {
		utils.IsSRT(subtitle1)
	}
}
